n7space/TASTE-SAMV71-RTEMS-Drivers/src/samv71_rtems_serial/samv71_rtems_serial.c
/**@file
 * This file is part of the TASTE SAMV71 RTEMS Drivers.
 *
 * @copyright 2025-2026 N7 Space Sp. z o.o.
 *
 * Licensed under the ESA Public License (ESA-PL) Permissive (Type 3),
 * Version 2.4 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     https://essr.esa.int/license/list
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include "samv71_rtems_serial.h"

#include <stdlib.h>

#include <Broker.h>
#include <assert.h>
#include <rtems.h>

#include <Hal.h>

#include <Escaper.h>
#include <EscaperInternal.h>
#include <Nvic/Nvic.h>
#include <Pio/Pio.h>
#include <Pmc/Pmc.h>
#include <SamV71Core/SamV71Core.h>
#include <Scb/Scb.h>
#include <Uart/Uart.h>
#include <Xdmac/xdmad.h>
#include <Utils/ErrorCode.h>

static Samv71RtemsSerial_UserUartErrorCallback
	Samv71RtemsSerial_user_uart_error_callback = NULL;
static void *Samv71RtemsSerial_user_uart_error_callback_arg = NULL;

static Samv71RtemsSerial_UserXdmadErrorCallback
	Samv71RtemsSerial_user_xdmad_error_callback = NULL;
static void *Samv71RtemsSerial_user_xdmad_error_callback_arg = NULL;

// global variable required by xdmad.c
rtems_id xdmad_lock;

static sXdmad xdmad;
static Uart *uart0handle;
static Uart *uart1handle;
static Uart *uart2handle;
static Uart *uart3handle;
static Uart *uart4handle;

/**
 * @brief UART/XDMAC priority definition - !! IMPORTANT !!
 * Interrupts that use RTEMS functions must have smaller priorities than
 * kernel interrupts levels. The lower the priority value, the
 * higher the priority is. In RTEMS on Cortex-M7, the PRIMASK in critical
 * sections is set to 0x80 - therefore, in order to avoid a
 * race condition (for example, an IRQ preempting internal RTEMS processing
 * and modifying it's internal data structures in a way unexpected by RTEMS,
 * potentially causing an undefined behaviour), IRQ handlers that use
 * RTEMS-related functionality like semaphores, events, etc. **MUST HAVE THEIR
 * PRIORITY SET TO AT LEAST 0x80 (4 after the bit-shift), OR LOWER (so,
 * higher value)**.
 * Safe IRQ priorities are in 4-7 inclusive range on SAMV71 and SAMRH71,
 * which corresponds to values 0x80, 0xA0, 0xC0 and 0xE0 for the
 * rtems_interrupt_set_priority function, as it expects shifted
 * values and writes them directly to NVIC register.
 */
#define UART_XDMAC_INTERRUPT_PRIORITY 4
#define UART_INTERRUPT_PRIORITY 4

#define UART_RX_EVENT RTEMS_EVENT_0

#define XDMAD_NO_POLLING 0

#ifndef UART_BLOCKING_WRITE_TIMEOUT
#define UART_BLOCKING_WRITE_TIMEOUT 10000
#endif

void UART0_Handler(void)
{
	if (uart0handle != NULL)
		Uart_handleInterrupt(uart0handle, NULL);
}

void UART1_Handler(void)
{
	if (uart1handle != NULL)
		Uart_handleInterrupt(uart1handle, NULL);
}

void UART2_Handler(void)
{
	if (uart2handle != NULL)
		Uart_handleInterrupt(uart2handle, NULL);
}

void UART3_Handler(void)
{
	if (uart3handle != NULL)
		Uart_handleInterrupt(uart3handle, NULL);
}

void UART4_Handler(void)
{
	if (uart4handle != NULL)
		Uart_handleInterrupt(uart4handle, NULL);
}

void XDMAC_Handler(void)
{
	XDMAD_Handler(&xdmad);
}

inline static void initDMALock()
{
	const rtems_status_code status_code =
		rtems_semaphore_create(SamV71Core_GenerateNewSemaphoreName(),
				       1, // Initial value, unlocked
				       RTEMS_BINARY_SEMAPHORE,
				       0, // Priority ceiling
				       &xdmad_lock);

	assert(status_code == RTEMS_SUCCESSFUL);
}

static inline void initDMA(void)
{
	SamV71Core_EnablePeripheralClock(Pmc_PeripheralId_Xdmac);

	Nvic_clearInterruptPending(Nvic_Irq_Xdmac);
	Nvic_setInterruptPriority(Nvic_Irq_Xdmac,
				  UART_XDMAC_INTERRUPT_PRIORITY);

	XDMAD_Initialize(&xdmad, XDMAD_NO_POLLING);

	SamV71Core_InterruptSubscribe(Nvic_Irq_Xdmac, "xdmac",
				      (rtems_interrupt_handler)&XDMAC_Handler,
				      NULL);
}

static inline void initUartIrq(Nvic_Irq irqId, char const *const info,
			       rtems_interrupt_handler handler)
{
	Nvic_clearInterruptPending(irqId);
	Nvic_setInterruptPriority(irqId, UART_INTERRUPT_PRIORITY);
	SamV71Core_InterruptSubscribe(irqId, info, handler, NULL);
}

static void uartLowLevelInit()
{
	static bool uartInitialized = false;
	if (!uartInitialized) {
		initDMALock();
		initUartIrq(Nvic_Irq_Uart0, "uart0",
			    (rtems_interrupt_handler)UART0_Handler);
		initUartIrq(Nvic_Irq_Uart1, "uart1",
			    (rtems_interrupt_handler)UART1_Handler);
		initUartIrq(Nvic_Irq_Uart2, "uart2",
			    (rtems_interrupt_handler)UART2_Handler);
		initUartIrq(Nvic_Irq_Uart3, "uart3",
			    (rtems_interrupt_handler)UART3_Handler);
		initUartIrq(Nvic_Irq_Uart4, "uart4",
			    (rtems_interrupt_handler)UART4_Handler);
		initDMA();
		uartInitialized = true;
	}
}

static void uartDMAHandler(uint32_t xdmacChannel, void *args)
{
	XDMAD_FreeChannel(&xdmad, xdmacChannel);
	const Uart_TxHandler *const uartTxHandler = (Uart_TxHandler *)args;
	uartTxHandler->callback(uartTxHandler->arg);
}

static void uartErrorHandler(const Uart_ErrorFlags *errorFlags, void *arg)
{
	(void)arg;
	if (Samv71RtemsSerial_user_uart_error_callback != NULL) {
		Samv71RtemsSerial_user_uart_error_callback(
			*errorFlags,
			Samv71RtemsSerial_user_uart_error_callback_arg);
	}
}

/*
 * Available UART pins configurations for 144-pin package SAMV71:
 * UART0:
 *   - URXD0 - PA9 (PIO peripheral A)
 *   - UTXD0 - PA10 (PIO peripheral A)
 * UART1:
 *   - URXD1 - PA5 (PIO peripheral C)
 *   - UTXD1 - PA4, PA6 (PIO peripheral C), PD26 (PIO peripheral D)
 * UART2:
 *   - URXD2 - PD25 (PIO peripheral C)
 *   - UTXD2 - PD26 (PIO peripheral C)
 * UART3:
 *   - URXD3 - PD28 (PIO peripheral A)
 *   - UTXD3 - PD30 (PIO peripheral A), PD31 (PIO peripheral A)
 * UART4:
 *   - URXD4 - PD18 (PIO peripheral C)
 *   - UTXD4 - PD3, PD19 (PIO peripheral C)
 */

static inline Samv71RtemsSerial_UartPinConfig
makeUartPinConfig(Pio_Port port, Pmc_PeripheralId peripheralId,
		  uint32_t pinMask, Pio_Control control)
{
	const Samv71RtemsSerial_UartPinConfig pinConfig = {
		.port = port,
		.peripheralId = peripheralId,
		.pinMask = pinMask,
		.control = control,
	};

