n7space/TASTE-SAMV71-RTEMS-Drivers/src/samv71_rtems_serial/samv71_rtems_serial.c
	return pinConfig;
}

static inline Uart_Id
getUartId(const Serial_SamV71_Rtems_Device_T *const device)
{
	switch (device->kind) {
	case uart0_PRESENT:
		return Uart_Id_0;
	case uart1_PRESENT:
		return Uart_Id_1;
	case uart2_PRESENT:
		return Uart_Id_2;
	case uart3_PRESENT:
		return Uart_Id_3;
	case uart4_PRESENT:
		return Uart_Id_4;
	default:
		// If this branch is hit, then the user provided configuration is invalid,
		// or something went very wrong and the program will enter invalid state, so
		// the safest course of action is to assert and abort (if the asserts are
		// disabled).
		assert(false && "Unsupported UART");
		abort();
	}
}

static inline Nvic_Irq
getUartIrqId(const Serial_SamV71_Rtems_Device_T *const device)
{
	switch (device->kind) {
	case uart0_PRESENT:
		return Nvic_Irq_Uart0;
	case uart1_PRESENT:
		return Nvic_Irq_Uart1;
	case uart2_PRESENT:
		return Nvic_Irq_Uart2;
	case uart3_PRESENT:
		return Nvic_Irq_Uart3;
	case uart4_PRESENT:
		return Nvic_Irq_Uart4;
	default:
		// If this branch is hit, then the user provided configuration is invalid,
		// or something went very wrong and the program will enter invalid state, so
		// the safest course of action is to assert and abort (if the asserts are
		// disabled).
		assert(false && "Unsupported UART");
		abort();
	}
}

static Samv71RtemsSerial_UartPinConfig
getUartTxPinConfig(const Serial_SamV71_Rtems_Device_T *const device)
{
	switch (device->kind) {
	case uart0_PRESENT:
		return makeUartPinConfig(Pio_Port_A, Pmc_PeripheralId_PioA,
					 PIO_PIN_10, Pio_Control_PeripheralA);
	case uart1_PRESENT:
		switch (device->u.uart1.tx) {
		case Serial_SamV71_Rtems_Device_T_uart1_tx_pa4:
			return makeUartPinConfig(Pio_Port_A,
						 Pmc_PeripheralId_PioA,
						 PIO_PIN_4,
						 Pio_Control_PeripheralC);
		case Serial_SamV71_Rtems_Device_T_uart1_tx_pa6:
			return makeUartPinConfig(Pio_Port_A,
						 Pmc_PeripheralId_PioA,
						 PIO_PIN_6,
						 Pio_Control_PeripheralC);
		case Serial_SamV71_Rtems_Device_T_uart1_tx_pd26:
			return makeUartPinConfig(Pio_Port_D,
						 Pmc_PeripheralId_PioD,
						 PIO_PIN_26,
						 Pio_Control_PeripheralD);
		default:
			// If this branch is hit, then the user provided configuration is invalid,
			// or something went very wrong and the program will enter invalid state,
			// so the safest course of action is to assert and abort (if the asserts
			// are disabled).
			assert(false && "Unsupported UART1 TX pin");
			abort();
		}
	case uart2_PRESENT:
		return makeUartPinConfig(Pio_Port_D, Pmc_PeripheralId_PioD,
					 PIO_PIN_26, Pio_Control_PeripheralC);
	case uart3_PRESENT:
		switch (device->u.uart3.tx) {
		case Serial_SamV71_Rtems_Device_T_uart3_tx_pd30:
			return makeUartPinConfig(Pio_Port_D,
						 Pmc_PeripheralId_PioD,
						 PIO_PIN_30,
						 Pio_Control_PeripheralA);
		case Serial_SamV71_Rtems_Device_T_uart3_tx_pd31:
			return makeUartPinConfig(Pio_Port_D,
						 Pmc_PeripheralId_PioD,
						 PIO_PIN_31,
						 Pio_Control_PeripheralA);
		default:
			// If this branch is hit, then the user provided configuration is invalid,
			// or something went very wrong and the program will enter invalid state,
			// so the safest course of action is to assert and abort (if the asserts
			// are disabled).
			assert(false && "Unsupported UART3 TX pin");
			abort();
		}
	case uart4_PRESENT:
		switch (device->u.uart4.tx) {
		case Serial_SamV71_Rtems_Device_T_uart4_tx_pd3:
			return makeUartPinConfig(Pio_Port_D,
						 Pmc_PeripheralId_PioD,
						 PIO_PIN_3,
						 Pio_Control_PeripheralC);
		case Serial_SamV71_Rtems_Device_T_uart4_tx_pd19:
			return makeUartPinConfig(Pio_Port_D,
						 Pmc_PeripheralId_PioD,
						 PIO_PIN_19,
						 Pio_Control_PeripheralC);
		default:
			// If this branch is hit, then the user provided configuration is invalid,
			// or something went very wrong and the program will enter invalid state,
			// so the safest course of action is to assert and abort (if the asserts
			// are disabled).
			assert(false && "Unsupported UART4 TX pin");
			abort();
		}
	default:
		// If this branch is hit, then the user provided configuration is invalid,
		// or something went very wrong and the program will enter invalid state,
		// so the safest course of action is to assert and abort (if the asserts
		// are disabled).
		assert(false && "Unsupported UART");
		abort();
	}
}

static Samv71RtemsSerial_UartPinConfig
getUartRxPinConfig(const Serial_SamV71_Rtems_Device_T *const device)
{
	switch (device->kind) {
	case uart0_PRESENT:
		return makeUartPinConfig(Pio_Port_A, Pmc_PeripheralId_PioA,
					 PIO_PIN_9, Pio_Control_PeripheralA);
	case uart1_PRESENT:
		return makeUartPinConfig(Pio_Port_A, Pmc_PeripheralId_PioA,
					 PIO_PIN_5, Pio_Control_PeripheralC);
	case uart2_PRESENT:
		return makeUartPinConfig(Pio_Port_D, Pmc_PeripheralId_PioD,
					 PIO_PIN_25, Pio_Control_PeripheralC);
	case uart3_PRESENT:
		return makeUartPinConfig(Pio_Port_D, Pmc_PeripheralId_PioD,
					 PIO_PIN_28, Pio_Control_PeripheralA);
	case uart4_PRESENT:
		return makeUartPinConfig(Pio_Port_D, Pmc_PeripheralId_PioD,
					 PIO_PIN_18, Pio_Control_PeripheralC);
	default:
		// If this branch is hit, then the user provided configuration is invalid,
		// or something went very wrong and the program will enter invalid state,
		// so the safest course of action is to assert and abort (if the asserts
		// are disabled).
		assert(false && "Unsupported UART");
		abort();
	}
}

static inline void
initUartPin(const Samv71RtemsSerial_UartPinConfig *const pinConfig,
	    Pio_Direction direction)
{
	Pio_Port_Config pioConfig = {.pinsConfig =
								   {
									   .pull = Pio_Pull_Up,
									   .filter = Pio_Filter_None,
									   .isMultiDriveEnabled = false,
									   .isSchmittTriggerDisabled = false,
									   .irq = Pio_Irq_None,
									   .direction = direction,
									   .control = pinConfig->control,
								   },
							   .debounceFilterDiv = 0,
							   .pins = pinConfig->pinMask};
	Pio pio;
	ErrorCode errorCode = 0;

	Pio_init(pinConfig->port, &pio, &errorCode);
	Pio_setPortConfig(&pio, &pioConfig, &errorCode);
}

static inline Pmc_PeripheralId getUartPeripheralId(Uart_Id id)
{
	switch (id) {
	case Uart_Id_0:
		return Pmc_PeripheralId_Uart0;
	case Uart_Id_1:
		return Pmc_PeripheralId_Uart1;
	case Uart_Id_2:
		return Pmc_PeripheralId_Uart2;
	case Uart_Id_3:
		return Pmc_PeripheralId_Uart3;
	case Uart_Id_4:
		return Pmc_PeripheralId_Uart4;
	default:
		// If this branch is hit, then the user provided configuration is invalid,
		// or something went very wrong and the program will enter invalid state,
		// so the safest course of action is to assert and abort (if the asserts
		// are disabled).
		assert(false && "Unsupported UART");
		abort();
	}
}

static inline void initUartPio(const Serial_SamV71_Rtems_Device_T *const device)
{
	const Samv71RtemsSerial_UartPinConfig txPinConfig =
		getUartTxPinConfig(device);
	const Samv71RtemsSerial_UartPinConfig rxPinConfig =
		getUartRxPinConfig(device);

	initUartPin(&txPinConfig, Pio_Direction_Output);
	initUartPin(&rxPinConfig, Pio_Direction_Input);
}

