n7space/TASTE-SAMV71-RTEMS-Drivers/src/samv71_rtems_serial/samv71_rtems_serial.c
inline static void initUartPmc(const Serial_SamV71_Rtems_Device_T *const device)
{
	const Samv71RtemsSerial_UartPinConfig txPinConfig =
		getUartTxPinConfig(device);
	const Samv71RtemsSerial_UartPinConfig rxPinConfig =
		getUartRxPinConfig(device);

	SamV71Core_EnablePeripheralClock(txPinConfig.peripheralId);
	if (rxPinConfig.peripheralId != txPinConfig.peripheralId) {
		SamV71Core_EnablePeripheralClock(rxPinConfig.peripheralId);
	}
	SamV71Core_EnablePeripheralClock(
		getUartPeripheralId(getUartId(device)));
}

inline static void initUartHandle(Uart *uart, Uart_Id id)
{
	switch (id) {
	case Uart_Id_0:
		uart0handle = uart;
		break;
	case Uart_Id_1:
		uart1handle = uart;
		break;
	case Uart_Id_2:
		uart2handle = uart;
		break;
	case Uart_Id_3:
		uart3handle = uart;
		break;
	case Uart_Id_4:
		uart4handle = uart;
		break;
	default:
		// If this branch is hit, then the user provided configuration is invalid,
		// or something went very wrong and the program will enter invalid state,
		// so the safest course of action is to assert and abort (if the asserts
		// are disabled).
		assert(false && "Unsupported UART");
		abort();
	}
}

static void initUartHardware(Samv71RtemsSerial_Uart *const halUart,
			     Samv71RtemsSerial_UartConfig halUartConfig,
			     const Serial_SamV71_Rtems_Device_T *const device)
{
	uartLowLevelInit();

	assert(halUartConfig.id <= Uart_Id_4);
	assert((halUartConfig.parity <= Uart_Parity_Odd) ||
	       (halUartConfig.parity == Uart_Parity_None));

	initUartPmc(device);
	initUartPio(device);
	initUartHandle(&halUart->uart, halUartConfig.id);

	Uart_init(halUartConfig.id, &halUart->uart);
	Uart_reset(&halUart->uart);

	const Uart_Config config = {
		.isTxEnabled = true,
		.isRxEnabled = true,
		.isTestModeEnabled = false,
		.parity = halUartConfig.parity,
		.baudRate = halUartConfig.baudrate,
		.baudRateClkSrc = Uart_BaudRateClk_PeripheralCk,
		.baudRateClkFreq = SamV71Core_GetMainClockFrequency()
	};
	Uart_setConfig(&halUart->uart, &config);
}

static void initUartTxDMACHannel(Samv71RtemsSerial_Uart *const halUart,
				 const uint8_t *const buffer,
				 const uint16_t length,
				 const Uart_TxHandler *const txHandler,
				 uint32_t channelNumber)
{
	const eXdmadRC prepareResult =
		XDMAD_PrepareChannel(&xdmad, channelNumber);
	if (prepareResult != XDMAD_OK) {
		if (Samv71RtemsSerial_user_xdmad_error_callback != NULL) {
			Samv71RtemsSerial_user_xdmad_error_callback(
				Samv71RtemsSerial_user_xdmad_error_callback_arg);
		}
		return;
	}

	//< Get Uart Tx peripheral xdmac id
	const uint32_t periphID = xdmad.XdmaChannels[channelNumber].bDstTxIfID
				  << XDMAC_CC_PERID_Pos;
	sXdmadCfg config = {
		// uBlock max length is equal to uart write max data length. Thus one
		// uBlock can be used.
		.mbr_ubc = length,
		// Data buffer as source addres
		.mbr_sa = (uint32_t)buffer,
		// Uart tx holding register as a destination address
		.mbr_da = (uint32_t)&halUart->uart.registers->thr,
		// Config memory to peripheral transfer. Increment source buffer address.
		// Keep destination address buffer fixed.
		.mbr_cfg = XDMAC_CC_TYPE_PER_TRAN | XDMAC_CC_MBSIZE_SINGLE |
			   XDMAC_CC_DSYNC_MEM2PER |
			   XDMAC_CC_SWREQ_HWR_CONNECTED |
			   XDMAC_CC_MEMSET_NORMAL_MODE | XDMAC_CC_DWIDTH_BYTE |
			   XDMAC_CC_SIF_AHB_IF1 | XDMAC_CC_DIF_AHB_IF1 |
			   XDMAC_CC_SAM_INCREMENTED_AM | XDMAC_CC_DAM_FIXED_AM |
			   periphID,
		// Disable data striding.
		.mbr_bc = 0,
		.mbr_ds = 0,
		.mbr_sus = 0,
		.mbr_dus = 0,
	};

	const eXdmadRC configureResult = XDMAD_ConfigureTransfer(
		&xdmad, channelNumber, &config, 0, 0,
		XDMAC_CIE_BIE | XDMAC_CIE_RBIE | XDMAC_CIE_WBIE |
			XDMAC_CIE_ROIE);
	if (configureResult != XDMAD_OK) {
		if (Samv71RtemsSerial_user_xdmad_error_callback != NULL) {
			Samv71RtemsSerial_user_xdmad_error_callback(
				Samv71RtemsSerial_user_xdmad_error_callback_arg);
		}
		return;
	}
	const eXdmadRC callbackResult = XDMAD_SetCallback(
		&xdmad, channelNumber, uartDMAHandler, (void *)txHandler);

	if (callbackResult != XDMAD_OK) {
		if (Samv71RtemsSerial_user_xdmad_error_callback != NULL) {
			Samv71RtemsSerial_user_xdmad_error_callback(
				Samv71RtemsSerial_user_xdmad_error_callback_arg);
		}
	}
}

/** \brief Asynchronously sends bytes over UART via DMA.
 *
 * \param [in] halUart Hal_Uart structure contains uart device descriptor and
 *                     relevant fifos.
 * \param [in] buffer array containing bytes to send
 * \param [in] length length of array of bytes
 * \param [in] txHandler pointer to the handler called after successful array
 *                       transmission
 */
static void uartWriteAsync(Samv71RtemsSerial_Uart *const halUart,
			   const uint8_t *const buffer, const uint16_t length,
			   const Uart_TxHandler *const txHandler)
{
	const uint32_t channelNumber =
		XDMAD_AllocateChannel(&xdmad, XDMAD_TRANSFER_MEMORY,
				      getUartPeripheralId(halUart->uart.id));

	if (channelNumber <
	    (xdmad.pXdmacs->XDMAC_GTYPE & XDMAC_GTYPE_NB_CH_Msk)) {
		initUartTxDMACHannel(halUart, buffer, length, txHandler,
				     channelNumber);
		const eXdmadRC startResult =
			XDMAD_StartTransfer(&xdmad, channelNumber);

		if ((startResult != XDMAD_OK) &&
		    (Samv71RtemsSerial_user_xdmad_error_callback != NULL)) {
			Samv71RtemsSerial_user_xdmad_error_callback(
				Samv71RtemsSerial_user_xdmad_error_callback_arg);
		}
	} else if (Samv71RtemsSerial_user_xdmad_error_callback != NULL) {
		Samv71RtemsSerial_user_xdmad_error_callback(
			Samv71RtemsSerial_user_xdmad_error_callback_arg);
	}
}

/** \brief Sends bytes over UART synchronously.
 *
 * \param [in] halUart Hal_Uart structure contains uart device descriptor
 * \param [in] buffer array containing bytes to send
 * \param [in] length length of array of bytes
 */
static void uartWriteBlocking(Samv71RtemsSerial_Uart *const halUart,
			      const uint8_t *const buffer,
			      const uint16_t length)
{
	ErrorCode errCode = ErrorCode_NoError;
	for (uint16_t i = 0; i < length; i++) {
		Uart_write(halUart->uart, buffer[i],
			   UART_BLOCKING_WRITE_TIMEOUT, &errCode);
		assert(errCode == ErrorCode_NoError);
	}
}

/** \brief Asynchronously receives bytes over uart.
 *
 * \param [in] halUart Hal_Uart structure contains uart device descriptor and
 *                     relevant fifos.
 * \param [in] buffer array where received bytes will be stored
 * \param [in] length length of array of bytes
 * \param [in] rxHandler handler called after successful array reception or
 *                       after matching character was found
 */
static void uartRead(Samv71RtemsSerial_Uart *const halUart,
		     uint8_t *const buffer, const uint16_t length,
		     const Uart_RxHandler rxHandler)
{
	const Uart_ErrorHandler errorHandler = { .callback = uartErrorHandler,
						 .arg = halUart };
	ByteFifo_init(&halUart->rxFifo, buffer, length);
	Uart_registerErrorHandler(&halUart->uart, errorHandler);
	Uart_readAsync(&halUart->uart, &halUart->rxFifo, rxHandler);
}

static inline void registerUartId(samv71_rtems_serial_private_data *self,
				  Serial_SamV71_Rtems_Device_T deviceName)
{
	self->m_hal_uart_config.id = getUartId(&deviceName);
}

static inline void initUartParity(samv71_rtems_serial_private_data *self,
				  Serial_SamV71_Rtems_Parity_T parity)
{
	switch (parity) {
	case Serial_SamV71_Rtems_Parity_T_odd:
		self->m_hal_uart_config.parity = Uart_Parity_Odd;
		break;
	case Serial_SamV71_Rtems_Parity_T_even:
		self->m_hal_uart_config.parity = Uart_Parity_Even;
		break;
	case Serial_SamV71_Rtems_Parity_T_none:
		self->m_hal_uart_config.parity = Uart_Parity_None;
		break;
	default:
		// If this branch is hit, then the user provided configuration is invalid,
		// or something went very wrong and the program will enter invalid state,
		// so the safest course of action is to assert and abort (if the asserts
		// are disabled).
		assert(false && "Not supported parity");
		abort();
	}
}

