n7space/TASTE-SAMV71-RTEMS-Drivers/src/samv71_rtems_serial/samv71_rtems_serial.c
static inline void initUartBaudrate(samv71_rtems_serial_private_data *self,
				    Serial_SamV71_Rtems_Baudrate_T speed)
{
	switch (speed) {
	case Serial_SamV71_Rtems_Baudrate_T_b9600:
		self->m_hal_uart_config.baudrate = 9600;
		break;
	case Serial_SamV71_Rtems_Baudrate_T_b19200:
		self->m_hal_uart_config.baudrate = 19200;
		break;
	case Serial_SamV71_Rtems_Baudrate_T_b38400:
		self->m_hal_uart_config.baudrate = 38400;
		break;
	case Serial_SamV71_Rtems_Baudrate_T_b57600:
		self->m_hal_uart_config.baudrate = 57600;
		break;
	case Serial_SamV71_Rtems_Baudrate_T_b115200:
		self->m_hal_uart_config.baudrate = 115200;
		break;
	case Serial_SamV71_Rtems_Baudrate_T_b230400:
		self->m_hal_uart_config.baudrate = 230400;
		break;
	default:
		// If this branch is hit, then the user provided configuration is invalid,
		// or something went very wrong and the program will enter invalid state,
		// so the safest course of action is to assert and abort (if the asserts
		// are disabled).
		assert(false && "Not supported baudrate");
		abort();
	}
}

static inline void
initUart(samv71_rtems_serial_private_data *const self,
	 const Serial_SamV71_Rtems_Conf_T *const device_configuration)
{
	self->m_device = device_configuration->devname;
	registerUartId(self, self->m_device);
	initUartParity(self, device_configuration->parity);
	initUartBaudrate(self, device_configuration->speed);
	initUartHardware(&self->m_hal_uart, self->m_hal_uart_config,
			 &self->m_device);
}

static void uartRxCallback(void *private_data)
{
	const samv71_rtems_serial_private_data *const self =
		(samv71_rtems_serial_private_data *)private_data;
	rtems_event_send(self->m_task, UART_RX_EVENT);
}

static void initUartRxHandler(samv71_rtems_serial_private_data *const self)
{
	switch (self->m_packetizer_mode.kind) {
	case raw_PRESENT:
		switch (self->m_packetizer_mode.u.raw.kind) {
		case single_byte_PRESENT:
			self->m_uart_rx_handler.lengthCallback = uartRxCallback;
			self->m_uart_rx_handler.lengthArg = self;
			self->m_uart_rx_handler.characterCallback = NULL;
			self->m_uart_rx_handler.characterArg = NULL;
			self->m_uart_rx_handler.targetLength = 1;
			break;
		case custom_escape_byte_PRESENT:
			self->m_uart_rx_handler.lengthCallback = uartRxCallback;
			self->m_uart_rx_handler.lengthArg = self;
			self->m_uart_rx_handler.characterCallback =
				uartRxCallback;
			self->m_uart_rx_handler.characterArg = self;
			self->m_uart_rx_handler.targetCharacter =
				self->m_packetizer_mode.u.raw.u
					.custom_escape_byte;
			self->m_uart_rx_handler.targetLength =
				Serial_SAMV71_RTEMS_RECV_BUFFER_SIZE / 2;
			break;
		default:
			// If this branch is hit, then the user provided configuration is invalid,
			// or something went very wrong and the program will enter invalid state, so
			// the safest course of action is to assert and abort (if the asserts are
			// disabled).
			assert(false && "Not supported raw mode kind");
			abort();
		}
		break;
	case escaped_packets_PRESENT:
		self->m_uart_rx_handler.lengthCallback = uartRxCallback;
		self->m_uart_rx_handler.lengthArg = self;
		self->m_uart_rx_handler.characterCallback = uartRxCallback;
		self->m_uart_rx_handler.characterArg = self;
		self->m_uart_rx_handler.targetCharacter = STOP_BYTE;
		self->m_uart_rx_handler.targetLength =
			Serial_SAMV71_RTEMS_RECV_BUFFER_SIZE / 2;
		break;
	default:
		// If this branch is hit, then the user provided configuration is invalid,
		// or something went very wrong and the program will enter invalid state, so
		// the safest course of action is to assert and abort (if the asserts are
		// disabled).
		assert(false && "Not supported mode kind");
		abort();
	}
}

static ByteFifo *uartTxCallback(void *private_data)
{
	const samv71_rtems_serial_private_data *const self =
		(samv71_rtems_serial_private_data *)private_data;

	const rtems_status_code releaseResult =
		rtems_semaphore_release(self->m_tx_semaphore);
	assert(releaseResult == RTEMS_SUCCESSFUL);
	return NULL;
}

static void initUartTxHandler(samv71_rtems_serial_private_data *const self)
{
	self->m_uart_tx_handler.callback = uartTxCallback;
	self->m_uart_tx_handler.arg = self;

	const rtems_status_code status_code =
		rtems_semaphore_create(SamV71Core_GenerateNewSemaphoreName(),
				       1, // Initial value, unlocked
				       RTEMS_SIMPLE_BINARY_SEMAPHORE,
				       0, // Priority ceiling
				       &self->m_tx_semaphore);

	assert(status_code == RTEMS_SUCCESSFUL);
}

static inline uint32_t
enterCriticalSection(samv71_rtems_serial_private_data *const self)
{
	const uint32_t mask = self->m_hal_uart.uart.registers->imr;
	self->m_hal_uart.uart.registers->idr = mask;
	MEMORY_SYNC_BARRIER();
	return mask;
}

static inline void
exitCriticalSection(samv71_rtems_serial_private_data *const self,
		    const uint32_t state)
{
	MEMORY_SYNC_BARRIER();
	self->m_hal_uart.uart.registers->ier = state;
}

static inline bool
rawModeEnabled(const samv71_rtems_serial_private_data *const self)
{
	return self->m_packetizer_mode.kind == raw_PRESENT;
}

void Samv71RtemsSerialInit(
	void *private_data, const enum SystemBus bus_id,
	const enum SystemDevice device_id,
	const Serial_SamV71_Rtems_Conf_T *const device_configuration,
	const Serial_SamV71_Rtems_Conf_T *const remote_device_configuration)
{
	(void)device_id;
	(void)remote_device_configuration;

	samv71_rtems_serial_private_data *const self =
		(samv71_rtems_serial_private_data *)private_data;

	self->m_ip_device_bus_id = bus_id;
	self->m_packetizer_mode = device_configuration->packetizer_mode;
	self->m_tx_mode = device_configuration->tx_mode;

	initUart(self, device_configuration);
	initUartRxHandler(self);
	initUartTxHandler(self);

	if (!rawModeEnabled(self)) {
		Escaper_init(&self->m_escaper, self->m_encoded_packet_buffer,
			     Serial_SAMV71_RTEMS_ENCODED_PACKET_MAX_SIZE,
			     self->m_decoded_packet_buffer,
			     Serial_SAMV71_RTEMS_DECODED_PACKET_MAX_SIZE);
	}

	const rtems_task_config taskConfig = {
		.name = SamV71Core_GenerateNewTaskName(),
		.initial_priority = 1,
		.storage_area = self->m_task_buffer,
		.storage_size = Serial_SAMV71_RTEMS_TASK_BUFFER_SIZE,
		.maximum_thread_local_storage_size =
			Serial_SAMV71_RTEMS_UART_TLS_SIZE,
		.storage_free = NULL,
		.initial_modes = RTEMS_PREEMPT,
		.attributes = RTEMS_DEFAULT_ATTRIBUTES | RTEMS_FLOATING_POINT
	};

