n7space/TASTE-SAMV71-RTEMS-Drivers/src/samv71_rtems_serial/samv71_rtems_serial.c
	const rtems_status_code taskConstructionResult =
		rtems_task_construct(&taskConfig, &self->m_task);
	assert(taskConstructionResult == RTEMS_SUCCESSFUL);

	const rtems_status_code taskStartStatus = rtems_task_start(
		self->m_task, (rtems_task_entry)&Samv71RtemsSerialPoll,
		(rtems_task_argument)self);
	assert(taskStartStatus == RTEMS_SUCCESSFUL);
}

void Samv71RtemsSerialPoll(rtems_task_argument private_data)
{
	samv71_rtems_serial_private_data *self =
		(samv71_rtems_serial_private_data *)private_data;

	if (!rawModeEnabled(self)) {
		// if raw mode is disabled, start the Escaper's decoder
		Escaper_start_decoder(&self->m_escaper);
	}

	uartRead(&self->m_hal_uart, self->m_fifo_memory_block,
		 Serial_SAMV71_RTEMS_RECV_BUFFER_SIZE, self->m_uart_rx_handler);

	while (true) {
		rtems_event_set received_events = 0;
		/// Wait for data to arrive - event shall be triggered by ISR
		const rtems_status_code eventStatus = rtems_event_receive(
			UART_RX_EVENT, RTEMS_WAIT | RTEMS_EVENT_ANY,
			RTEMS_NO_TIMEOUT, &received_events);

		if (eventStatus == RTEMS_SUCCESSFUL &&
		    (received_events & UART_RX_EVENT)) {
			// Extract all the data to a local buffer to make sure the time in
			// critical section is minimal
			const uint32_t irqMask = enterCriticalSection(self);
			size_t length = 0;
			while (ByteFifo_pull(&self->m_hal_uart.rxFifo,
					     &self->m_recv_buffer[length])) {
				length++;
			}
			exitCriticalSection(self, irqMask);

			if (rawModeEnabled(self)) {
				// if raw mode is enabled, call the Broker directly
				for (size_t i = 0; i < length; i++) {
					Broker_receive_packet(
						self->m_ip_device_bus_id,
						&self->m_recv_buffer[i], 1);
				}
			} else {
				// if raw mode is disabled, use Escaper
				Escaper_decode_packet(&self->m_escaper,
						      self->m_ip_device_bus_id,
						      self->m_recv_buffer,
						      length,
						      Broker_receive_packet);
			}
		}
	}
}

static inline bool
blockingTxModeEnabled(const samv71_rtems_serial_private_data *const self)
{
	return self->m_tx_mode == Serial_SamV71_Rtems_Tx_Mode_T_blocking;
}

/**
 * @brief Packet write function signature.
 *
 * Used to abstract over blocking vs async TX modes.
 */
typedef void (*Samv71RtemsSerial_WritePacketFn)(Samv71RtemsSerial_Uart *const,
						const uint8_t *const,
						const uint16_t);

/**
 * @brief Encode data with Escaper and send each encoded packet.
 *
 * Calls writePacket for every encoded packet after running the
 * Escaper encoder over the full input.
 */
static void sendEscapedPackets(samv71_rtems_serial_private_data *const self,
			       const uint8_t *const data, const size_t length,
			       Samv71RtemsSerial_WritePacketFn writePacket)
{
	Escaper_start_encoder(&self->m_escaper);

	size_t index = 0;
	while (index < length) {
		const size_t packetLength = Escaper_encode_packet(
			&self->m_escaper, data, length, &index);

		writePacket(&self->m_hal_uart, &self->m_encoded_packet_buffer,
			    packetLength);
	}
}

static inline void
waitForTxSemaphore(samv71_rtems_serial_private_data *const self)
{
	const rtems_status_code obtainResult = rtems_semaphore_obtain(
		self->m_tx_semaphore, RTEMS_WAIT, RTEMS_NO_TIMEOUT);
	assert(obtainResult == RTEMS_SUCCESSFUL);
}

/**
 * @brief Write callback for async TX mode: semaphore wait then DMA send.
 */
static void asyncWritePacket(Samv71RtemsSerial_Uart *const halUart,
			     uint8_t *const buffer, const uint16_t length)
{
	const samv71_rtems_serial_private_data *const self =
		(samv71_rtems_serial_private_data *)halUart->uart.priv;

	waitForTxSemaphore(self);
	uartWriteAsync(halUart, buffer, length, &self->m_uart_tx_handler);
}

void Samv71RtemsSerialSend(void *private_data, const uint8_t *const data,
			   const size_t length)
{
	samv71_rtems_serial_private_data *const self =
		(samv71_rtems_serial_private_data *)private_data;

	if (!rawModeEnabled(self)) {
		// Escaped packets mode: encode then send
		if (blockingTxModeEnabled(self)) {
			sendEscapedPackets(self, data, length,
					   uartWriteBlocking);
		} else {
			sendEscapedPackets(self, data, length,
					   asyncWritePacket);
		}
	} else {
		// Raw mode: send data directly
		if (blockingTxModeEnabled(self)) {
			uartWriteBlocking(&self->m_hal_uart, data, length);
		} else {
			waitForTxSemaphore(self);
			uartWriteAsync(&self->m_hal_uart, data, length,
				       &self->m_uart_tx_handler);
		}
	}
}

void Samv71RtemsSerialRegisterUserUartErrorCallback(
	Samv71RtemsSerial_UserUartErrorCallback callback, void *arg)
{
	Samv71RtemsSerial_user_uart_error_callback = callback;
	Samv71RtemsSerial_user_uart_error_callback_arg = arg;
}

void Samv71RtemsSerialRegisterUserXdmadErrorCallback(
	Samv71RtemsSerial_UserXdmadErrorCallback callback, void *arg)
{
	Samv71RtemsSerial_user_xdmad_error_callback = callback;
	Samv71RtemsSerial_user_xdmad_error_callback_arg = arg;
}
